resources/wales/ab/demog-req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetPatientDemographics xmlns="http://tempuri.org/">
      <CRN>{{crn}}</CRN>
      <NHSNo>{{nhs-number}}</NHSNo>
    </GetPatientDemographics>
  </soap:Body>
</soap:Envelope>